// 문서 객체 모델 (DOM)
// XML or HTML문서에 접근하기 위한 일종의 인터페이스
// 문서 내의 모든 요소를 정의하고 , 접근하느 방법을 제공

// DOM은 W3C의 표준객체 모델 계층 구조로 표현이 된다.
// JS는 추가,제거,요소변경,
//      속성변경, 스타일변경, 이벤트추가, 이벤트 반응

// W3C DOM 표준을 세 가지 모델로 구분
// 1. Core DOM : 모든 문서 타입을 위한 DOM모델
// 2. HTML DOM : HTML 문서를 위한 DOM 모델
// 3. XML DOM : XML 문서를 위한 DOM 모델

// HTML DOM -> 문서를 조작하고 접근하는 표준화된 방법
//            모든 HTML 요소는 HTML DOM을 통해 접근
// XML DOM -> 문서를 다루는 표준화된 방법을 정의
//            모든 XML 요소는 XML DOM을 통해 접근

// Document 객체 -> 웹 페이지 그 자체를 의미

// Document 메소드
// -> HTML요소와 관련돤 작업을 토와주는 메서드
// 1. 요소의 선택 2. 요소의 생성 3. 이벤트 핸들러 4. 객체의 선택
